# Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
# При вызове функции должен создаваться объект-генератор.
# Функция вызывается следующим образом: for el in fact(n).
# Она отвечает за получение факториала числа. В цикле нужно выводить только первые n чисел, начиная с 1! и до n!.
# Подсказка: факториал числа n — произведение чисел от 1 до n.
# Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.

def generate_factorial(number):
    current = 1
    for i in range(1, number + 1):
        current *= i
        yield current

numb = 10
for ind, el in enumerate(generate_factorial(numb)):
    print(f'№{ind + 1} {el}')
