# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

numbers = [15, 4.7, 'student', False, []]
for elem in numbers:
    print(elem)
    print(type(elem))
