# Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.

number = int(input('Введите целое число от 1 до 15: '))
while number <= 15:
    print(number)
    number = number + 1
print('максимальное число')
